export type VT = {
    name: string;
    iconFile: string;
    yt: string;
    attrsSet: number[][];
    score: number;
}

export const VTS: VT[] = [
	{
		name: "宮乃やみ",
		iconFile: "yami001.jpg",
		yt: "https://www.youtube.com/@miyanoyami",
		attrsSet: [
			[3], // 1.声 渋い~かわいい(0~4)
			[1], // 2.見た目(女性~男性:0~4)
			[1], // 3.テンション(クール~パッション:0~4)
			[2], // 4.ベテラン？(新人~ベテラン:0~4)
			[2], // 5.規模(小~大:0~4)
			[2,3], // 6.コンテンツ(歌0,お絵かき1,ゲーム2,雑談3,TRPG4,ホラー5,ASMR6,企画7,その他8)
			[0], // 7.トーク/リアクション(0,1)
			[1], // 8.ケモミミ？ 0:yes, 1:no
			[1], // 9.オッドアイ? 0:yes, 1:no
			[0], // 10.眼鏡? 0:yes, 1:no
			[0], // 11.和服? 0:yes, 1:no
			[1], // 12.ロリショタ？0:yes, 1:no
			[1], // 13.人外?0:yes, 1:no
			[1], // 14.メカ?0:yes, 1:no
			[1], // 15.方言?0:yes, 1:no
			[1], // 16.下ネタ得意?0:yes, 1:no
			[1], // 17.メカクレ?0:yes, 1:no
			[0], // 18.お酒は好き?0:yes, 1:no
		],
		score: 0,
	},
	{
		name: "日乃芽メラニカ",
		iconFile: "meranica001.jpg",
		yt: "https://www.youtube.com/@meranicaCh",
		attrsSet: [
			[4], // 1.声 渋い~かわいい(0~4)
			[0], // 2.見た目(女性~男性:0~4)
			[3], // 3.テンション(クール~パッション:0~4)
			[2], // 4.ベテラン？(新人~ベテラン:0~4)
			[2], // 5.規模(小~大:0~4)
			[2,3], // 6.コンテンツ(歌0,お絵かき1,ゲーム2,雑談3,TRPG4,ホラー5,ASMR6,企画7,その他8)
			[0], // 7.トーク/リアクション(0,1)
			[0], // 8.ケモミミ？ 0:yes, 1:no
			[1], // 9.オッドアイ? 0:yes, 1:no
			[1], // 10.眼鏡? 0:yes, 1:no
			[1], // 11.和服? 0:yes, 1:no
			[0], // 12.ロリショタ？0:yes, 1:no
			[1], // 13.人外?0:yes, 1:no
			[1], // 14.メカ?0:yes, 1:no
			[1], // 15.方言?0:yes, 1:no
			[1], // 16.下ネタ得意?0:yes, 1:no
			[1], // 17.メカクレ?0:yes, 1:no
			[0], // 18.お酒は好き?0:yes, 1:no
		],
		score: 0,
	},
	{
		name: "紅桃あると",
		iconFile: "alto001.jpg",
		yt: "https://www.youtube.com/@kurumi_alto",
		attrsSet: [
			[4], // 1.声 渋い~かわいい(0~4)
			[0], // 2.見た目(女性~男性:0~4)
			[4], // 3.テンション(クール~パッション:0~4)
			[2], // 4.ベテラン？(新人~ベテラン:0~4)
			[2], // 5.規模(小~大:0~4)
			[0,2], // 6.コンテンツ(歌0,お絵かき1,ゲーム2,雑談3,TRPG4,ホラー5,ASMR6,企画7,その他8)
			[1], // 7.トーク/リアクション(0,1)
			[1], // 8.ケモミミ？ 0:yes, 1:no
			[1], // 9.オッドアイ? 0:yes, 1:no
			[1], // 10.眼鏡? 0:yes, 1:no
			[1], // 11.和服? 0:yes, 1:no
			[1], // 12.ロリショタ？0:yes, 1:no
			[0], // 13.人外?0:yes, 1:no
			[1], // 14.メカ?0:yes, 1:no
			[1], // 15.方言?0:yes, 1:no
			[0], // 16.下ネタ得意?0:yes, 1:no
			[1], // 17.メカクレ?0:yes, 1:no
			[1], // 18.お酒は好き?0:yes, 1:no
		],
		score: 0,
	},
	{
		name: "のらまに",
		iconFile: "noramani001.jpg",
		yt: "https://www.youtube.com/c/noramanichannel",
		attrsSet: [
			[2], // 1.声 渋い~かわいい(0~4)
			[4], // 2.見た目(女性~男性:0~4)
			[2], // 3.テンション(クール~パッション:0~4)
			[2], // 4.ベテラン？(新人~ベテラン:0~4)
			[2], // 5.規模(小~大:0~4)
			[2], // 6.コンテンツ(歌0,お絵かき1,ゲーム2,雑談3,TRPG4,ホラー5,ASMR6,企画7,その他8)
			[0], // 7.トーク/リアクション(0,1)
			[1], // 8.ケモミミ？ 0:yes, 1:no
			[1], // 9.オッドアイ? 0:yes, 1:no
			[1], // 10.眼鏡? 0:yes, 1:no
			[1], // 11.和服? 0:yes, 1:no
			[1], // 12.ロリショタ？0:yes, 1:no
			[1], // 13.人外?0:yes, 1:no
			[1], // 14.メカ?0:yes, 1:no
			[1], // 15.方言?0:yes, 1:no
			[1], // 16.下ネタ得意?0:yes, 1:no
			[1], // 17.メカクレ?0:yes, 1:no
			[1], // 18.お酒は好き?0:yes, 1:no
		],
		score: 0,
	},
	{
		name: "詠ヴィオラ",
		iconFile: "viola001.jpg",
		yt: "http://youtube.com/@NGMViola",
		attrsSet: [
			[3], // 1.声 渋い~かわいい(0~4)
			[0], // 2.見た目(女性~男性:0~4)
			[2], // 3.テンション(クール~パッション:0~4)
			[0], // 4.ベテラン？(新人~ベテラン:0~4)
			[0], // 5.規模(小~大:0~4)
			[0,2], // 6.コンテンツ(歌0,お絵かき1,ゲーム2,雑談3,TRPG4,ホラー5,ASMR6,企画7,その他8)
			[0], // 7.トーク/リアクション(0,1)
			[1], // 8.ケモミミ？ 0:yes, 1:no
			[1], // 9.オッドアイ? 0:yes, 1:no
			[1], // 10.眼鏡? 0:yes, 1:no
			[1], // 11.和服? 0:yes, 1:no
			[1], // 12.ロリショタ？0:yes, 1:no
			[0], // 13.人外?0:yes, 1:no
			[1], // 14.メカ?0:yes, 1:no
			[1], // 15.方言?0:yes, 1:no
			[1], // 16.下ネタ得意?0:yes, 1:no
			[1], // 17.メカクレ?0:yes, 1:no
			[0], // 18.お酒は好き?0:yes, 1:no
		],
		score: 0,
	},
	{
		name: "kurenaif",
		iconFile: "kurenaif001.jpg",
		yt: "https://www.youtube.com/c/kurenaif",
		attrsSet: [
			[3], // 1.声 渋い~かわいい(0~4)
			[1], // 2.見た目(女性~男性:0~4)
			[0], // 3.テンション(クール~パッション:0~4)
			[2], // 4.ベテラン？(新人~ベテラン:0~4)
			[2], // 5.規模(小~大:0~4)
			[8], // 6.コンテンツ(歌0,お絵かき1,ゲーム2,雑談3,TRPG4,ホラー5,ASMR6,企画7,学術8,その他9)
			[0], // 7.トーク/リアクション(0,1)
			[1], // 8.ケモミミ？ 0:yes, 1:no
			[1], // 9.オッドアイ? 0:yes, 1:no
			[1], // 10.眼鏡? 0:yes, 1:no
			[1], // 11.和服? 0:yes, 1:no
			[1], // 12.ロリショタ？0:yes, 1:no
			[1], // 13.人外?0:yes, 1:no
			[1], // 14.メカ?0:yes, 1:no
			[1], // 15.方言?0:yes, 1:no
			[1], // 16.下ネタ得意?0:yes, 1:no
			[1], // 17.メカクレ?0:yes, 1:no
			[1], // 18.お酒は好き?0:yes, 1:no
		],
		score: 0,
	},
	{
		name: "隣野寧音",
		iconFile: "neine001.jpg",
		yt: "https://www.youtube.com/@NeineChannel",
		attrsSet: [
			[3], // 1.声 渋い~かわいい(0~4)
			[0], // 2.見た目(女性~男性:0~4)
			[1], // 3.テンション(クール~パッション:0~4)
			[2], // 4.ベテラン？(新人~ベテラン:0~4)
			[2], // 5.規模(小~大:0~4)
			[0,1], // 6.コンテンツ(歌0,お絵かき1,ゲーム2,雑談3,TRPG4,ホラー5,ASMR6,企画7,その他8)
			[0], // 7.トーク/リアクション(0,1)
			[0], // 8.ケモミミ？ 0:yes, 1:no
			[1], // 9.オッドアイ? 0:yes, 1:no
			[1], // 10.眼鏡? 0:yes, 1:no
			[1], // 11.和服? 0:yes, 1:no
			[1], // 12.ロリショタ？0:yes, 1:no
			[0], // 13.人外?0:yes, 1:no
			[1], // 14.メカ?0:yes, 1:no
			[1], // 15.方言?0:yes, 1:no
			[1], // 16.下ネタ得意?0:yes, 1:no
			[1], // 17.メカクレ?0:yes, 1:no
			[1], // 18.お酒は好き?0:yes, 1:no
		],
		score: 0,
	},
	{
		name: "パイナップル秀夫",
		iconFile: "hideo001.jpg",
		yt: "https://www.youtube.com/@PineappleHideo",
		attrsSet: [
			[3], // 1.声 渋い~かわいい(0~4)
			[0], // 2.見た目(女性~男性:0~4)
			[3], // 3.テンション(クール~パッション:0~4)
			[2], // 4.ベテラン？(新人~ベテラン:0~4)
			[1], // 5.規模(小~大:0~4)
			[0], // 6.コンテンツ(歌0,お絵かき1,ゲーム2,雑談3,TRPG4,ホラー5,ASMR6,企画7,その他8)
			[0], // 7.トーク/リアクション(0,1)
			[1], // 8.ケモミミ？ 0:yes, 1:no
			[1], // 9.オッドアイ? 0:yes, 1:no
			[1], // 10.眼鏡? 0:yes, 1:no
			[1], // 11.和服? 0:yes, 1:no
			[1], // 12.ロリショタ？0:yes, 1:no
			[0], // 13.人外?0:yes, 1:no
			[1], // 14.メカ?0:yes, 1:no
			[1], // 15.方言?0:yes, 1:no
			[1], // 16.下ネタ得意?0:yes, 1:no
			[1], // 17.メカクレ?0:yes, 1:no
			[1], // 18.お酒は好き?0:yes, 1:no
		],
		score: 0,
	},
]
